; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	infrared0 - mode
	thermograph4 - mode
	image9 - mode
	infrared1 - mode
	image5 - mode
	thermograph2 - mode
	image6 - mode
	spectrograph8 - mode
	image3 - mode
	infrared7 - mode
	Star0 - direction
	Star4 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 image3)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation3)
	(supports instrument1 thermograph2)
	(supports instrument1 image5)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 infrared1)
	(supports instrument2 thermograph4)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star4)
	(supports instrument3 image9)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet6)
	(supports instrument4 image3)
	(supports instrument4 image6)
	(supports instrument4 infrared7)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star4)
	(supports instrument5 infrared0)
	(supports instrument5 spectrograph8)
	(supports instrument5 infrared1)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation1)
)
(:goal (and
	(pointing satellite1 Planet7)
	(pointing satellite2 GroundStation3)
	(pointing satellite3 Star4)
	(have_image Phenomenon5 image6)
	(have_image Phenomenon5 infrared0)
	(have_image Planet6 thermograph4)
	(have_image Planet6 image9)
	(have_image Planet6 thermograph2)
	(have_image Planet7 image3)
	(have_image Phenomenon8 image5)
	(have_image Phenomenon9 image3)
	(have_image Phenomenon9 thermograph2)
	(have_image Phenomenon9 infrared0)
	(have_image Planet10 infrared1)
	(have_image Planet10 image5)
))

)

; plan
1. (turn_to satellite2 groundstation1 star4)
   deleted: (pointing satellite2 star4)
   added: (pointing satellite2 groundstation1)
   goals met: 0 of 15
2. (turn_to satellite1 star4 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star4)
   goals met: 0 of 15
3. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 15
4. (calibrate satellite1 instrument2 star4)
   added: (calibrated instrument2)
   goals met: 0 of 15
5. (turn_to satellite1 planet6 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 planet6)
   goals met: 0 of 15
6. (take_image satellite1 planet6 instrument2 thermograph4)
   added: (have_image planet6 thermograph4)
   goals met: 1 of 15
7. (take_image satellite1 planet6 instrument2 thermograph2)
   added: (have_image planet6 thermograph2)
   goals met: 2 of 15
8. (turn_to satellite1 groundstation2 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 groundstation2)
   goals met: 2 of 15
9. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 2 of 15
10. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 2 of 15
11. (switch_off instrument2 satellite1)
   deleted: (power_on instrument2)
   added: (power_avail satellite1)
   goals met: 2 of 15
12. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 2 of 15
13. (calibrate satellite2 instrument4 groundstation1)
   added: (calibrated instrument4)
   goals met: 2 of 15
14. (calibrate satellite1 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 2 of 15
15. (turn_to satellite1 phenomenon8 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 phenomenon8)
   goals met: 2 of 15
16. (take_image satellite1 phenomenon8 instrument1 image5)
   added: (have_image phenomenon8 image5)
   goals met: 3 of 15
17. (turn_to satellite1 phenomenon9 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 phenomenon9)
   goals met: 3 of 15
18. (take_image satellite1 phenomenon9 instrument1 thermograph2)
   added: (have_image phenomenon9 thermograph2)
   goals met: 4 of 15
19. (turn_to satellite1 planet10 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 planet10)
   goals met: 4 of 15
20. (take_image satellite1 planet10 instrument1 image5)
   added: (have_image planet10 image5)
   goals met: 5 of 15
21. (switch_off instrument1 satellite1)
   deleted: (power_on instrument1)
   added: (power_avail satellite1)
   goals met: 5 of 15
22. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 5 of 15
23. (turn_to satellite1 groundstation3 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 groundstation3)
   goals met: 5 of 15
24. (calibrate satellite1 instrument3 groundstation3)
   added: (calibrated instrument3)
   goals met: 5 of 15
25. (turn_to satellite1 planet6 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 planet6)
   goals met: 5 of 15
26. (take_image satellite1 planet6 instrument3 image9)
   added: (have_image planet6 image9)
   goals met: 6 of 15
27. (turn_to satellite1 planet7 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 planet7)
   goals met: 7 of 15
28. (turn_to satellite2 phenomenon5 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 phenomenon5)
   goals met: 7 of 15
29. (take_image satellite2 phenomenon5 instrument4 image6)
   added: (have_image phenomenon5 image6)
   goals met: 8 of 15
30. (turn_to satellite2 phenomenon9 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 phenomenon9)
   goals met: 8 of 15
31. (take_image satellite2 phenomenon9 instrument4 image3)
   added: (have_image phenomenon9 image3)
   goals met: 9 of 15
32. (turn_to satellite2 planet7 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 planet7)
   goals met: 9 of 15
33. (take_image satellite2 planet7 instrument4 image3)
   added: (have_image planet7 image3)
   goals met: 10 of 15
34. (turn_to satellite2 groundstation3 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 groundstation3)
   goals met: 11 of 15
35. (turn_to satellite3 groundstation2 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 groundstation2)
   goals met: 11 of 15
36. (calibrate satellite3 instrument5 groundstation2)
   added: (calibrated instrument5)
   goals met: 11 of 15
37. (turn_to satellite3 phenomenon5 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 phenomenon5)
   goals met: 11 of 15
38. (take_image satellite3 phenomenon5 instrument5 infrared0)
   added: (have_image phenomenon5 infrared0)
   goals met: 12 of 15
39. (turn_to satellite3 phenomenon9 phenomenon5)
   deleted: (pointing satellite3 phenomenon5)
   added: (pointing satellite3 phenomenon9)
   goals met: 12 of 15
40. (take_image satellite3 phenomenon9 instrument5 infrared0)
   added: (have_image phenomenon9 infrared0)
   goals met: 13 of 15
41. (turn_to satellite3 planet10 phenomenon9)
   deleted: (pointing satellite3 phenomenon9)
   added: (pointing satellite3 planet10)
   goals met: 13 of 15
42. (take_image satellite3 planet10 instrument5 infrared1)
   added: (have_image planet10 infrared1)
   goals met: 14 of 15
43. (turn_to satellite3 star4 planet10)
   deleted: (pointing satellite3 planet10)
   added: (pointing satellite3 star4)
   goals met: 15 of 15
